---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DetailFailures.RepeatingDetailSpacingZeroError
source: html/ae28150e-b7e2-8adf-f449-a6e8dfc546c3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DetailFailures.RepeatingDetailSpacingZeroError Property

Spacing must be greater than 0

## Syntax (C#)
```csharp
public static FailureDefinitionId RepeatingDetailSpacingZeroError { get; }
```